{
    "1988 feature film[edit]": [
        "Cameos in the film include science fiction and film industry personalities (Forrest J. Ackerman, Angelique Pettyjohn, Ward Kimball, Will Ryan, and a pre-Miami Vice Philip Michael Thomas) as well as composer John Massari. The only \"lookalike\" used in the film was a Woody Allen impersonator who appears in two scenes when Mike is being chased by the Keystone Cops through the studio lot.\nThe two \"real\" police characters played by Philip Michael Thomas and Lynda Aldon are named Mickey (Polanko) and Minnie (Smith), respectively, in the film and the police dog's name is Pluto.\nWhen asked by television producers if he had ever played a police officer, Philip Michael Thomas replied \"Yes, I was a cop in a feature film.\" This led to his being cast in Miami Vice.\nTwo characters are given names related to cigarettes: Lucky Straeker, Bookman's director and Dora Belair, an assistant to a competing show's producer. According to Mike Jittlov, \"Everyone in Hollywood gets burned.\"\nJittlov's mother and brother appear as themselves.\nA special birthday song, \"Merry Birthday to You\",[5] was composed to avoid potential licensing issues for the traditional \"Happy Birthday to You\".\nSome parts of \"The Wizard's Run\" have been changed, mostly reflecting Paige Moore's starring role.\nIn the stunt driving shots from the car-chase scene, Pluto, the police dog in the back seat, was played by Jittlov wearing a coat over his head.\nAs shown in the film, Mike Jittlov avoids shaking hands.[citation needed]\nOver 1000 subliminals are embedded throughout the film.[citation needed]\nThe poster for the film was done by artist Kelly Freas, who put a number of subliminal images into the painting; Freas also printed the faux film titles seen on the producers' bulletin board.[citation needed]\nThe fans in the climactic theater scene provided their own costumes.\nThe opening credits read \"Directed By The Man In The Green Jacket\". Mike Jittlov wears a green jacket throughout the film.\nThe scenes in which Mike speaks to the Union representatives were all shot at the same desk in the same room, with veteran voice-over artist Will Ryan playing all the representatives. The film union seal shows a vulture with a twisted strip of film in its talons.\nCinematographer Russell Carpenter later worked on such films as The Lawnmower Man, The Indian in the Cupboard, Titanic, Charlie's Angels (and the sequel Charlie's Angels: Full Throttle), Shallow Hal and Monster-in-Law.\nComposer John Massari later worked on such films as Killer Klowns from Outer Space, Skeletons, Retro Puppet Master, and such television shows as POV Murder and Prison Break: Proof of Innocence.\nThe film's musical score that plays during \"the Wizard's Run\" was recently used in a trailer for the Toy Story 3 videogame.\nA Spanish language dubbed version was released onto VHS under the title El Mago de la Velocidad y el Tiempo.[6]"
    ]
}